# ANS Project Submission

### 1
Confirm > Next Question

### 2

```markdown
1. Landlords have: ssn, phone, mail, and name and can be registered in a Housing Agency.
2. Tenants have: ssn, phone, mail, name, job, and can only rent one property.
3. Properties have: address, postcode, status (furnished/unfurnished), rent, and rooms and can have multiple tenants.
4. Housing agencies have websites, names, and areas of operation.
5. Flats are properties that also have a floor number and can have a kitchen.
6. Houses are properties that can have a garage and a garden.
7. Every landlord must have at least one property.
8. Properties can have 0 or more tenants.
9. A housing contract is a relation between a Landlord, Tenants, and optionally a Housing Agency.
10. Tenants can also be resident assistants and residents, a resident assistant manages a group of residents```

### 3a

![ERD](files/ERD.jpg)

Download .jpg file from datarius/files/ERD.jpg

### 3b

This is an Entity-Relationship Diagram (ERD) for a housing rental system. It shows how different entities relate to each other.

"IS-A" Relationship: This is present between the Property and its subtypes House and Flat. This relationship shows inheritance, where House and Flat inherit attributes from Property and also have their unique attributes.

Aggregation: The "Contracts" relation is associated with the "Supervised by Housing management" relation table.

Ternary Relationship: The Contracts relation table involves Property, Landlord, and Tenant entities.

Weak Entities: Based on the landlord's entities, we identify Emergency Contacts as weak entities.

The relationships are as follows:

- Landlord to Property: One-to-many (at least one).
- Tenant to Property: Many-to-one (a tenant can rent only one property at a time).
- Property to Tenant: One-to-many (a property can be rented by multiple tenants, but not at the same time based on point 3).
- Housing Agency to Landlord: One-to-many (an agency can have multiple landlords registered).
- Housing Agency to Property: One-to-many (an agency supervises many properties).
- Resident Assistant to Residents: One-to-many (an RA manages a group of residents).

### 4a

```sql
--create table for landlords
DROP TABLE IF EXISTS Landlords;
CREATE TABLE Landlords(
lssn INTEGER PRIMARY KEY, 
name TEXT NOT NULL, 
job TEXT, phone INTEGER, email TEXT NOT NULL);

INSERT INTO Landlords (lssn, name, job, phone, email) VALUES
(2984, 'Laura Smith', 'Engineer', 0694829475, 'laurasmith@email.com'),
(2985, 'Mark Johnson', 'Teacher', 0672829054, 'markjohnson@email.com'),
(2986, 'Sarah Brown', 'Nurse', 0656724003, 'sarahbrown@email.com'),
(2987, 'Michael Davis', 'Architect', 0638824067, 'michaeldavis@email.com'),
(2988, 'Emma Wilson', 'Lawyer', 0625824011, 'emmawilson@email.com'),
(2989, 'Daniel Moore', 'Chef', 0693824062, 'danielmoore@email.com'),
(2990, 'Olivia Taylor', 'Artist', 0681824033, 'oliviataylor@email.com'),
(2991, 'William Anderson', 'Writer', 0649824076, 'williamanderson@email.com'),
(8392, 'Sophia Thomas', 'Scientist', 0665824099, 'sophiathomas@email.com'),
(2993, 'Lucas Jackson', 'Musician', 0677824004, 'lucasjackson@email.com'),
(2564, 'Mia Martin', 'Photographer', 0653824065, 'miamartin@email.com'),
(1195, 'Benjamin Lee', 'Programmer', 0642824088, 'benjaminlee@email.com'),
(5666, 'Isabella Harris', 'Designer', 0631824077, 'isabellaharris@email.com'),
(7997, 'Ethan Clark', 'Accountant', 0629824066, 'ethanclark@email.com'),
(3575, 'Ava Lewis', 'Journalist', 0699824055, 'avalewis@email.com'),
(2999, 'Matthew Walker', 'Doctor', 0683824012, 'matthewwalker@email.com'),
(5425, 'Elizabeth Allen', 'Dentist', 0674824078, 'elizabethallen@email.com'),
(3001, 'Henry Young', 'Economist', 0663824089, 'henryyoung@email.com'),
(9658, 'Zoe Hernandez', 'Psychologist', 0658824056, 'zoehernandez@email.com'),
(5455, 'Jackson King', 'Biologist', 0644824047, 'jacksonking@email.com');

--create table for tenants
DROP TABLE IF EXISTS Tenants;
CREATE TABLE Tenants(
tssn INTEGER PRIMARY KEY, 
name TEXT NOT NULL, 
job TEXT, phone INTEGER, 
email TEXT NOT NULL, 
cid INTEGER,
FOREIGN KEY (cid)
REFERENCES Contracts(cid));

INSERT INTO Tenants (tssn, name, job, phone, email, cid) VALUES 
(948343,'John Doe','Student',068346234,'j.doe@email.com', 538),
(235786,'Mary Smith','Programmer',067892345,'mary.smith@email.com', 714),
(674821,'David Johnson','Student',065432789,'david.johnson@email.com', 269),
(389765,'Emily Brown','Student',068947123,'emily.brown@email.com', 785),
(546278,'Emma Wilson','Lawyer',064512378,'emmawilson@email.com', 413),
(123590,'Daniel Moore','Chef',067823456,'danielmoore@email.com', 626),
(789452,'Christopher Anderson','Student',062378945,'christopher.anderson@email.com', 821),
(982345,'Samantha Martinez','Student',069874512,'samantha.martinez@email.com', 472),
(456783,'James Thompson','Programmer',061234567,'james.thompson@email.com', 199),
(879234,'Amanda Davis','Student',068735624,'amanda.davis@email.com', 823),
(234568,'Robert Rodriguez','Teacher',065498712,'robert.rodriguez@email.com', 982),
(784512,'Olivia Garcia','Student',063472189,'olivia.garcia@email.com', 601),
(325478,'Daniel Hernandez','Programmer',064897321,'daniel.hernandez@email.com', 428),
(657894,'Isabella Lopez','Artist',067382945,'isabella.lopez@email.com', 695),
(347865,'William Martinez','Programmer',062345671,'william.martinez@email.com', 185),
(219873,'Ava Gonzalez','Student',069845231,'ava.gonzalez@email.com', 742),
(568912,'Sophia Perez','Student',068734512,'sophia.perez@email.com', 437),
(456789,'Alexander Wilson','Student',065493821,'alexander.wilson@email.com', 374),
(678945,'Mia Moore','Student',064235789,'mia.moore@email.com', 805),
(198273,'Jacob Jackson','Student',067894512,'jacob.jackson@email.com', 249);

--WEAK ENTITY SET
DROP TABLE IF EXISTS EmergencyContacts;
CREATE TABLE EmergencyContacts(
    ename TEXT NOT NULL,
    ephone INTEGER, 
    lssn INTEGER UNIQUE,
    PRIMARY KEY(ephone, lssn),
    FOREIGN KEY(lssn) REFERENCES Landlords(lssn) ON DELETE CASCADE);

INSERT INTO EmergencyContacts (ename, ephone, lssn) VALUES 
    ('John Doe', 1234567890, 2984),
    ('Mary Smith', 2345678901, 2985),
    ('David Johnson', 3456789012, 2986),
    ('Emily Brown', 4567890123, 2987),
    ('Emma Wilson', 5678901234, 2988),
    ('Daniel Moore', 6789012345, 2989),
    ('Christopher Anderson', 7890123456, 2990),
    ('Samantha Martinez', 8901234567, 2991),
    ('James Thompson', 9012345678, 8392),
    ('Amanda Davis', 1234567891, 2993);

--emails are set to not null because we need them for communication as well as names

--create table for housing agencies
DROP TABLE IF EXISTS HousingAgency;
    CREATE TABLE HousingAgency(
    a_name TEXT PRIMARY KEY,
    website TEXT,
    area TEXT);

INSERT INTO HousingAgency (a_name, website, area) VALUES 
('De Huurbaas', 'www.dehuurbaas.nl', 'Leiden Centrum'),
('Woning Wereld', 'www.woningwereld.nl', 'Leiden Zuid'),
('Huis Huren', 'www.huishuren.nl', 'Leiden Oost'),
('De Makelaar', 'www.demakelaar.nl', 'Leiden Noord'),
('Huur Expert', 'www.huurexpert.nl', 'Leiden Binnenstad'),
('PandPlaats', 'www.pandplaats.nl', 'Leiden Merenwijk'),
('Huur Winkel', 'www.huurwinkel.nl', 'Leiden Stevenshof'),
('Woon Expertise', 'www.woonexpertise.nl', 'Leiden Rijnsoever'),
('KamerGemak', 'www.kamergemak.nl', 'Leiden Groenoord'),
('HuisVinder', 'www.huisvinder.nl', 'Leiden Cronestein');

--create table with property attributes
DROP TABLE IF EXISTS Property_Manages;
CREATE TABLE Property_Manages(
paddress TEXT, postcode TEXT,
rent INTEGER, rooms INTEGER, 
is_furnished BOOLEAN,
PRIMARY KEY(paddress, postcode));

--use inheritance to create flats and houses (IS-A relationship with Property_Manages)
--IS A RELATIONSHIP
--flats have also a floor number and own kitchen and houses have a garden and garage

DROP TABLE IF EXISTS Flats;
CREATE TABLE Flats(
paddress TEXT, postcode TEXT,
floor_number INTEGER, own_kitchen BOOLEAN,
PRIMARY KEY(paddress, postcode), 
FOREIGN KEY(paddress, postcode) 
REFERENCES Property_Manages(paddress, postcode)
ON DELETE CASCADE);

INSERT INTO Flats (paddress, postcode, floor_number, own_kitchen) VALUES 
('Steenstraat 10','2312 BW Leiden',3,1),
('Einsteinweg 20','2333 CC Leiden',2,0),
('Hooigracht 87','2312 KP Leiden',1,1),
('Kerkstraat 23','2301 AB Leiden',4,0),
('Winkelsteegseweg 12','2302 CD Leiden',2,1),
('Kloosterweg 76','2315 EF Leiden',3,1),
('Oude Singel 33','2314 GH Leiden',2,0),
('Beestenmarkt 44','2313 XY Leiden',5,1),
('Hogewoerd 21','2311 HC Leiden',1,0),
('Rapenburg 8','2311 EW Leiden',4,1),
('Herengracht 15','2312 LM Leiden',3,0),
('Breestraat 19','2311 CH Leiden',2,1),
('Molenstraat 5','2315 JK Leiden',1,0),
('Nieuwe Rijn 27','2312 JX Leiden',3,1),
('Hogewoerd 68','2311 HT Leiden',2,0),
('Langegracht 92','2312 VA Leiden',4,1),
('Rapenburg 72','2311 GJ Leiden',1,0),
('Zoeterwoudsesingel 36','2313 DW Leiden',3,1),
('Vrijheidslaan 65','2321 JR Leiden',1,1),
('Kort Rapenburg 2','2311 GC Leiden',2,1);

DROP TABLE IF EXISTS Houses;
CREATE TABLE Houses(
paddress TEXT, postcode TEXT,
garden BOOLEAN, garage BOOLEAN,
PRIMARY KEY(paddress, postcode),
FOREIGN KEY(paddress, postcode) 
REFERENCES Property_Manages(paddress, postcode)
ON DELETE CASCADE);

INSERT INTO Houses (paddress, postcode, garden, garage) VALUES 
('Gangetje 3','2311 ER Leiden',1,1),
('Zonneveldstraat 7','2313 VP Leiden',0,1),
('Dorpstraat 14','2316 AD Leiden',1,1),
('Jan van Goyenkade 29','2311 AD Leiden',1,0),
('Oosterkerkstraat 6','2313 RV Leiden',1,1),
('Botermarkt 22','2311 EN Leiden',0,1),
('Kolfmakersteeg 4','2312 TA Leiden',3,1),
('Hoge Woerd 40','2312 HJ Leiden',1,0),
('Vlietweg 9','2315 TM Leiden',1,1),
('Langebrug 11','2311 TG Leiden',0,1),
('Witte Singel 8','2311 BG Leiden',1,1),
('Kerkplein 5','2312 PK Leiden',1,0),
('Roodenburgerdistrict 14','2315 GE Leiden',1,1),
('Vestestraat 20','2312 SH Leiden',1,0),
('Rijn en Schiekade 36','2311 LM Leiden',0,1),
('Schelpenkade 16','2313 ZZ Leiden',1,0),
('Dorpsstraat 29','2317 BA Leiden',1,1),
('Pieterskerk-Choorsteeg 22','2311 XS Leiden',1,1),
('Gasthuissteeg 3','2312 AT Leiden',1,1),
('Breestraat 9','2311 AA Leiden',1,0);


--modify the property to model 1 to many
--relationship with landlords
ALTER TABLE Property_Manages
ADD COLUMN lssn INTEGER 
REFERENCES Landlords(lssn);


--SELF-JOIN with roles
--resident assistants and residents (for tenants), there is an RA for a certain group of tenants

DROP TABLE IF EXISTS Assists;
CREATE TABLE Assists(
resident_assistant_ssn INTEGER,
resident_ssn INTEGER, 
PRIMARY KEY(resident_assistant_ssn, resident_ssn),
FOREIGN KEY(resident_assistant_ssn) REFERENCES Tenants(tssn),
FOREIGN KEY(resident_ssn) REFERENCES Tenants(tssn));

INSERT INTO Assists (resident_assistant_ssn, resident_ssn) VALUES 
(948343, 235786),
(674821, 389765),
(546278, 123590),
(789452, 982345),
(456783, 879234),
(234568, 784512),
(325478, 657894),
(347865, 219873),
(568912, 456789),
(678945, 198273);

--AGGREGATION
--a landlord can have multiple tenants for once contract
--a housing agency can have 0 or more contracts so it
--is optional in the relationship

--KEY CONSTRAINT
--a tenant can have only one contract
--that is why we alter the table tenants instead of 
--adding tssn to Contracts

--TERNARY RELATIONSHIP
DROP TABLE IF EXISTS Contracts;
CREATE TABLE Contracts(
cid INTEGER PRIMARY KEY,
lssn INTEGER NOT NULL,
a_name TEXT,
paddress TEXT NOT NULL,
postcode TEXT NOT NULL,
FOREIGN KEY(lssn) REFERENCES Landlords(lssn),
FOREIGN KEY(a_name) REFERENCES HousingAgency(a_name)
FOREIGN KEY(paddress, postcode) REFERENCES Property_Manages(paddress, postcode));

--combined total participation and key constraint

INSERT INTO Property_Manages (paddress, postcode, rent, rooms, is_furnished, lssn) VALUES 
('Steenstraat 35','2312 BT Leiden',845,2,1,1195),
('Hooigracht 78','2312 KP Leiden',800,1,1,2989),
('Oude Singel 33','2333 GH Leiden',710,1,1,2993),
('Beestenmarkt 44','2313 XY Leiden',1480,3,1,2987),
('Hogewoerd 21','2311 HC Leiden',690,1,1,2987),
('Dorpstraat 14','2333 AD Leiden',490,1,0,2988),
('Jan van Goyenkade 29','2311 AD Leiden',1520,3,1,8392),
('Oosterkerkstraat 6','2313 RV Leiden',670,1,1,2991),
('Kolfmakersteeg 4','2312 TA Leiden',1640,3,1,2993),
('Vrouwensteeg 8','2312 DM Leiden',720,1,1,2988),
('Bargelaan 25','2333 CT Leiden',1570,3,1,1195),
('Diefsteeg 17','2311 TW Leiden',680,1,1,2988),
('Oude Rijn 41','2312 HG Leiden',1530,3,1,2564),
('Vismarkt 10','2332 LJ Leiden',1490,3,1,2),
('Kerkstraat 7','2312 BH Leiden',900,2,1,7997),
('Nieuwstraat 14','2315 EA Leiden',1200,2,1,5666),
('Schelpenkade 9','2333 ZZ Leiden',1100,2,1,2999),
('Langegracht 5','2312 VA Leiden',980,2,1,3575),
('Molenstraat 12','2315 JK Leiden',920,2,1,5455),
('Achterom 8','2311 TV Leiden',1000,2,1,9658),
('Vestestraat 16','2312 SH Leiden',940,2,1,5425),
('Hoge Woerd 20','2312 HJ Leiden',950,2,1,3201);

INSERT INTO Contracts (cid, lssn, a_name, paddress, postcode) VALUES 
(269, 1195, 'Huis Huren', 'Steenstraat 35', '2312 BT Leiden'),
(785, 2989, 'De Makelaar', 'Hooigracht 78', '2312 KP Leiden'),
(696, 2993, 'Huur Winkel', 'Oude Singel 33', '2333 GH Leiden'),
(742, 2987, 'PandPlaats', 'Beestenmarkt 44', '2313 XY Leiden'),
(413, 8392, 'Huur Expert', 'Jan van Goyenkade 29', '2311 AD Leiden'),
(626, 2991, 'PandPlaats', 'Oosterkerkstraat 6', '2313 RV Leiden'),
(821, 2993, 'Huur Winkel', 'Kolfmakersteeg 4', '2312 TA Leiden'),
(472, 1195, 'Woon Expertise', 'Bargelaan 25', '2333 CT Leiden'),
(199, 2988, 'KamerGemak', 'Diefsteeg 17', '2311 TW Leiden'),
(823, 2564, 'HuisVinder', 'Oude Rijn 41', '2312 HG Leiden'),
(982, 3002, 'De Huurdbaas', 'Vismarkt 10', '2332 LJ Leiden'),
(601, 7997, 'Woning Wereld', 'Kerkstraat 7', '2312 BH Leiden'),
(428, 5666, 'Huis Huren', 'Nieuwstraat 14', '2315 EA Leiden'),
(695, 2999, 'De Makelaar', 'Schelpenkade 9', '2333 ZZ Leiden'),
(185, 3575, 'Huur Expert', 'Langegracht 5', '2312 VA Leiden'),
(437, 5455, 'Huur Winkel', 'Molenstraat 12', '2315 JK Leiden'),
(374, 9658, 'Woon Expertise', 'Achterom 8', '2311 TV Leiden'),
(805, 5425, 'KamerGemak', 'Vestestraat 16', '2312 SH Leiden'),
(249, 3201, 'HuisVinder', 'Hoge Woerd 20', '2312 HJ Leiden');
```

### 4b

We cannot enforce total participation between the tenant and the housing contract by design because, in theory, the cid field for the tenant table can be null so we manually have to insert all the tenant tuples with not empty cids.

### 5a

```sql
SELECT job, COUNT(*) AS num_tenants
FROM Tenants
GROUP BY job
HAVING num_tenants > 2;
```

### 5b

It groups tenants by their job titles and counts the number of tenants for each job category.
The HAVING clause filters the results to include only those job categories with more than two tenants.

### 5c

```sql
SELECT lssn, name
FROM Landlords
WHERE lssn IN (
SELECT lssn FROM Property_Manages
WHERE postcode LIKE '%Leiden%')
UNION
SELECT tssn, name
FROM Tenants
WHERE cid IN (
SELECT cid FROM Contracts
WHERE postcode LIKE '%Leiden%');
```

### 5d

Select the landlords own properties in Leiden and tenants who live in Leiden.

### 5e

```sql
SELECT paddress, rent
FROM Property_Manages
WHERE rent > (
    SELECT AVG(rent) 
    FROM Property_Manages
);
```

### 5f

This query retrieves the addresses and rents of properties where the rent is higher than the average rent of all properties.

### 5g

```sql
SELECT 
    MAX(rent) AS max_rent,
    MIN(rent) AS min_rent,
    AVG(rent) AS avg_rent,
    SUM(rent) AS total_rent 
FROM Property_Manages;
```

### 5h

This query retrieves the maximum, minimum, average, and total rent of all properties.

### 5i

```sql
SELECT Landlords.name, Property_Manages.paddress
FROM Landlords
JOIN Property_Manages ON Landlords.lssn = Property_Manages.lssn;
```

### 5j

This command will retrieve the names of the landlords
with addresses of their properties where the lssn matches between the two tables.

### 5k

```sql
SELECT lssn, name
FROM Landlords
WHERE lssn IN (
SELECT lssn FROM EmergencyContacts E
WHERE E.ename LIKE 'E%');
```

### 5l

Select lssn and name of landlords who have an emergency contact that has a name that starts with E.

### 5m

```sql
SELECT l.name, AVG(pm.rent) AS average_rent
FROM Landlords l
JOIN Property_Manages pm ON l.lssn = pm.lssn
GROUP BY l.name;
```

### 5n

This query will help identify the landlords who manages properties with the highest average rent, which can help us find lucrative property management opportunities.

### 5o

```sql
SELECT tssn, name
FROM Tenants
WHERE cid IN 
(SELECT cid FROM Property_Manages
WHERE (paddress, postcode) IN 
(SELECT paddress, postcode 
FROM Flats
WHERE own_kitchen = TRUE));
```

### 5p

Select ssn and names of tenants who live in flats with their own kitchen.